#200-400变量# 断句

# 给药方式 已经合并
#年龄 已合并
#功能

#1-200的工鞥那字符串
function_12_str = "(?:镇静.催眠|镇静.镇痛|镇静.?催眠.急性乙醇戒断|镇静催眠、急性酒精戒断|抗焦虑.镇静催眠|镇痛麻醉|手术后镇痛|分娩镇痛|镇静|催眠|镇痛|抗恐惧|抗癫痫.抗惊厥|小儿惊厥|癫痫持续状态和严重复发性癫痫|癫痫持续状态|一般性失眠|抗?癫痫|抗?失眠|抗?惊厥|抗?焦虑|乙醇戒断|基础麻醉或静脉全麻" \
               "|术前准备|麻醉前用药|麻醉前给药|表面麻醉.神经阻滞麻醉及硬膜外麻醉|神经阻滞或硬膜外麻醉|剖宫产手术硬膜外麻醉|硬膜外麻醉用?|术后应用|诱导麻醉|维持麻醉|表面麻醉|入睡困难|睡眠维持障碍|基础麻醉|抗躁狂或抗精神病|偏头痛的?预防性?治?疗?|偏头痛和慢性每?日?头痛的治疗|偏头痛的发作期治疗|用于|中重度妊娠高血压征、先兆子痫和子痫" \
               "|早产与治疗妊娠高血压|帕金森病、多发性硬化症及痉挛状态|帕金森病|不宁腿综合征|抽动秽语综合征|肝豆状核变性|用于急性严?重?疼痛|中枢性呼吸及循环功能不全|中枢抑制催醒|术?后?催醒|急性脑血栓和脑栓塞|治疗深静脉血栓|治疗急性血栓栓塞|预防手术后深静脉血栓|深静脉血栓或肺栓塞" \
               "|缺血性脑卒中或短暂性脑缺血发作（TIA）|左房室瓣病或心房颤动伴栓塞|蛛网膜下隙出血|蛛网膜下隙阻滞|急性脑血管病恢复期|脑动脉硬化，脑梗死恢复期|中枢性和外周性眩晕|椎动脉供血不足|特发性耳鸣|间歇性跛行|缺血性脑血管病急性期及其他缺血性血管疾病" \
               "|脑梗死急性期|脑外伤及脑手术后的意识障碍|良性记忆障碍|阿尔茨海默病和?.{0,3}血管性痴呆|阿尔茨海默病|重症肌无力、肌营养不良症、多发性周围神经病|确?诊?重症肌无力的?确?证?|治疗重症肌无力|重症肌无力" \
               "|获得性振动性眼球震颤|神经性膀胱功能障碍|假性近视|术后腹胀气或尿潴|对抗非去极化型肌松药的肌松作用|麻醉诱导|全麻.?诱导|全身麻醉|全麻维持量?|全麻诱导|平衡麻醉|全凭静脉麻醉|局部麻醉或椎管内麻醉辅助用药" \
               "|眼科用|耳鼻喉科用|髄管阻滞|硬膜外阻滞?|区域阻滞|神经传导阻滞|外周神经阻滞麻醉|外周神经阻滞|交感神经节阻滞|神经干（丛）阻滞|胃镜检査|尿道扩张术或膀胱镜检査|臂丛神经阻滞麻?醉?|紙管阻滞|硬脊膜外阻滞|局部浸润麻?醉?" \
               "|硬膜外腔阻滞麻?醉?|电休克|快?速?气管插管|维持肌肉松弛|半去极化肌松药的拮抗|青光眼|呕吐|精神分裂症|肾功能不全|肝功能不全|遗尿症|抗高胆红素血症|缓释制剂|治疗心律失常|拮抗东芨着碱中毒" \
               "|静脉全麻|神经阻滞麻醉|吸入麻醉|缓释片|神经阻滞或浸润麻醉|表面局麻|腰麻|神经阻滞|"

function_24_str = "治疗抑郁症|治疗强迫症|缓慢用药法|抗过敏|过敏性休克|预防心绞痛|治疗佐林格埃利森综合征|抢救感染中毒性休克|抗心律失常|缓解内脏绞痛|治疗心绞痛|术前用药)"

function_24 = function_12_str+function_24_str

#200-400的指定切分字符串
zd_24 = "(?:预防用药剂量|与丙戊酸钠合用|与酶诱导药（除丙戊酸钠之外）合用时|用于肾血管性高血压药物诊断|肾功能损害时|酒石酸盐美托洛尔|用于心律失常的急症处理|心功能Ⅲ〜IV级" \
            "|氢溟酸右美沙芬颗粒|氢漠酸右美沙芬糖浆|氢漠酸右美沙芬缓释片|硫酸沙丁胺醇缓释片|硫酸沙丁胺醇粉雾剂|;控释片|体重≥20kg|肾功能不全患者（肾小球滤过率≤50ml/min）" \
            "|；严重时|粉雾吸入：|；或者|溶液雾化吸入|症状严重者|反流性食管炎，|反流性食管炎的对症治疗|肌酐淸除率为15〜30ml/min|肌酐清除率小于15ml/min时|十二指肠溃疡患者" \
            "|皿度或IV度|注射用药：|＞20kg,|NERD|对严重中毒|单用时：对轻度中毒|对中度中毒|对重度中毒|气管插管|外周血管疾病|球后注射|中度肾功能不全时|粉雾吸入：" \
            "|在肾功能障碍时|肌酐清除率10〜40ml/min时|肌酊清除率＜10ml/min|维拉帕米缓释片|严重心律失常应急|需要静脉给药时|结膜下注射|用于体外电除颤无效的室颤时" \
            "|反流性食管炎，|中度至重度食管炎|反流性食管炎的长期治疗|消化性溃疡：|治疗Hp感染|但在根除Hp治疗|抢救感染中毒性休克、改善微循环)+"

#按年龄、功能、作用切分时 含部分关键字的时候不进行切分
dose_forbid_24 = []
dose_forbid_12=["维持量","极量","限量","最大量","总量","维持","继以","患者的耐受情况","耐受的用量"]
forbid_24 = ["门诊患者","住院患者","大部分患者","90%以上患者","1周疗法","应对患者进一步检査","对于反流性疾病的症状治疗","无发作","老年人及肝肾功能不全者","疗效不佳者可增加剂量",
                  "根据患者的疗效和耐受情况","密切观察患者","大多数患者","根据患者的临床反应","成人处方极量","根据患者年龄和症状适当增减","通常对成人","患者耐受情况","已接受全剂量",
                  "耐受的情况","患者可耐受","体重＜85kg","体重≥85kg","耐受调整剂量","但必须告诉患者","一般药量为每小时","患者的需要和耐受性","可控制症状","在1周疗法中","如患者无发作"]

dose_forbid_24.extend(dose_forbid_12)
dose_forbid_24.extend(forbid_24)